import { Level } from './types';
import { BALL_COLORS } from './constants';

const levels: Level[] = [{
  title: `Level 1

A long, long time ago
somewhere in
south, south
America`,
  speed: 25, // fps и количество тиков pusher в секунду
  balls: 60,
  ballColors: [BALL_COLORS.YELLOW, BALL_COLORS.PINK],
  frogPosition: { x: 303, y: 310 },
  skullPosition: { x: 515, y: 310 },
  scorePosition: { x: 90, y: 50 },
  rollOut: 60, // как далеко выкатывать в начале уровня
  start: [421, 0], // начало кривой Безье
  curve: [ // контрольные точки
    [502, 36, 623, 113, 690, 195],
    [738, 254, 759, 298, 757, 349],
    [755, 406, 722, 458, 694, 480],
    [655, 511, 577, 536, 528, 543],
    [396, 563, 317, 546, 218, 512],
    [185, 501, 98, 459, 61, 386],
    [38, 341, 41, 288, 58, 241],
    [76, 192, 117, 151, 147, 129],
    [195, 93, 256, 86, 334, 102],
    [413, 118, 479, 136, 583, 214],
    [611, 235, 654, 278, 666, 320],
    [680, 368, 670, 411, 610, 451],
    [575, 474, 501, 491, 450, 493],
    [384, 495, 312, 482, 249, 455],
    [206, 437, 155, 406, 122, 359],
    [96, 322, 107, 269, 130, 233],
    [155, 195, 196, 174, 238, 167],
    [278, 160, 317, 162, 356, 173],
    [394, 184, 448, 205, 470, 219],
    [512, 246, 543, 266, 562, 312],
  ],
}];

export default Object.freeze(levels);
